#+title: Monthly Mean Global Temperatures
#+author: J. Dylan White
#+date: <2022-12-13 Tue>
#+PROPERTY: header-args:python :session *py* :mkdirp yes

* Explore the Data

#+begin_src python :results value

  # Import modules
  import xarray

  # Set the file path
  filePath = "./data/air.mon.mean.nc"
  
  # Open the dataset with xarray
  ds = xarray.open_dataset(filePath)

  # Show a summary of the data 
  ds

#+end_src

#+RESULTS:
#+begin_example
<xarray.Dataset>
Dimensions:  (lat: 73, lon: 144, time: 899)
Coordinates:
  ,* lat      (lat) float32 90.0 87.5 85.0 82.5 80.0 ... -82.5 -85.0 -87.5 -90.0
  ,* lon      (lon) float32 0.0 2.5 5.0 7.5 10.0 ... 350.0 352.5 355.0 357.5
  ,* time     (time) datetime64[ns] 1948-01-01 1948-02-01 ... 2022-11-01
Data variables:
    air      (time, lat, lon) float32 ...
Attributes:
    description:    Data from NCEP initialized reanalysis (4x/day).  These ar...
    platform:       Model
    Conventions:    COARDS
    NCO:            20121012
    history:        Thu May  4 20:11:16 2000: ncrcat -d time,0,623 /Datasets/...
    title:          monthly mean air.sig995 from the NCEP Reanalysis
    dataset_title:  NCEP-NCAR Reanalysis 1
    References:     http://www.psl.noaa.gov/data/gridded/data.ncep.reanalysis...
#+end_example

The dataset spans the globe every 2.5 degrees latitude and longitude, and monthly from 1948 to the present. One thing we may want to do is convert the 0 to 360 degree longitudes to -180 to 180 degree longitudes.

#+begin_src python :results value

  # Convert from 0 to 360 to -180 to 180
  ds.coords['lon'] = (ds.coords['lon'] + 180) % 360 - 180

  # Sort by longitudes to rearrage
  ds = ds.sortby(ds.lon)

  # Display the updated summary
  ds

#+end_src

#+RESULTS:
#+begin_example
<xarray.Dataset>
Dimensions:  (lat: 73, lon: 144, time: 899)
Coordinates:
  ,* lat      (lat) float32 90.0 87.5 85.0 82.5 80.0 ... -82.5 -85.0 -87.5 -90.0
  ,* lon      (lon) float32 -180.0 -177.5 -175.0 -172.5 ... 172.5 175.0 177.5
  ,* time     (time) datetime64[ns] 1948-01-01 1948-02-01 ... 2022-11-01
Data variables:
    air      (time, lat, lon) float32 ...
Attributes:
    description:    Data from NCEP initialized reanalysis (4x/day).  These ar...
    platform:       Model
    Conventions:    COARDS
    NCO:            20121012
    history:        Thu May  4 20:11:16 2000: ncrcat -d time,0,623 /Datasets/...
    title:          monthly mean air.sig995 from the NCEP Reanalysis
    dataset_title:  NCEP-NCAR Reanalysis 1
    References:     http://www.psl.noaa.gov/data/gridded/data.ncep.reanalysis...
#+end_example

